{
    "comments": [
        {
            "userId": "",
            "text": "Yes"
        },
        {
            "userId": "",
            "text": "UT Dallas, University of Pittsburgh, Rutgers University, UNCC, UMBC"
        },
        {
            "userId": "",
            "text": "UCR , it's amazing and has gre waived off too"
        },
        {
            "userId": "",
            "text": "It's a usual delay. It takes around 15 business days for ielts to send your official score report"
        },
        {
            "userId": "",
            "text": "Stanford is isolated: it's a very pretty but sometimes dull campus. Students rely on bikes: dangerous traffic jams on campus! Pre-Covid, dorm rooms small and shared: school had little options for those with crazy roommates. Wonderful research opportunities: profs open to exploration of topics of interest. Personalized education: you aren't just a face in the crowd. Library system terrific: they help! Grading is fair, not on a curve. "
        },
        {
            "userId": "",
            "text": "Very welcoming environment. Professors are very understanding and want you to succeed. This is a challenging school and clearly geared towards people with a tendency towards logic and math."
        },
        {
            "userId": "",
            "text": "I loved Stevens and the engineering curriculum. Every semester you have design projects that really help you apply what you learn in the classroom."
        },
        {
            "userId": "",
            "text": "I recently completed my first semester at USC and I gotta say, the hype really exists for a reason. Most of my expectations were met and some were even exceeded by my experience at this school. There's a lot of reviews and advice about USC out there, but one thing I would say is this: if you are the kind of person who can easily feel lonely or isolated in a new city or institution, this is the place for you. Making friends is literally so easy here and it is very unlikely for someone to feel a low sense of community here. Fight On!"
        },
        {
            "userId": "",
            "text": "Rutgers University, you will have great opportunities after Master's program"
        },
        {
            "userId": "",
            "text": "Hi, I have received an admit from University of Connecticut."
        },
        {
            "userId": "",
            "text": "It takes around 10-15 business days for ielts to send the scores to university."
        },
        {
            "userId": "",
            "text": "I think you should go for generalised computer science since it gives you opportunity to explore more."
        }
    ]
}